### 1. Write code which accomplishes the following tasks:

a. Create a list of integers from 1 to 100. Using list comprehension, generate a list of squares of the above integers if they are odd

In [4]:
int_list = list(range(100)) # creating a list from 1 to 100

In [27]:
squares = [x ** 2 for x in int_list if x % 2 != 0]
print(squares)

[1, 9, 25, 49, 81, 121, 169, 225, 289, 361, 441, 529, 625, 729, 841, 961, 1089, 1225, 1369, 1521, 1681, 1849, 2025, 2209, 2401, 2601, 2809, 3025, 3249, 3481, 3721, 3969, 4225, 4489, 4761, 5041, 5329, 5625, 5929, 6241, 6561, 6889, 7225, 7569, 7921, 8281, 8649, 9025, 9409, 9801]

b. Write a function that returns the number of vowels in a given string

In [30]:
def vowel_fun(my_string):
    count =0
    vowels_list = ['a','e','i','o','u']
    for character in my_string:
        for vowels in vowels_list:
            if(character == vowels):
                count += 1
    print(count)

In [32]:
vowel_fun("I am a king")

3

### 2. Write a function in python that takes a string as an input and returns the sum of the numbers corresponding to each alphabets position from a to z. (Hint: can use a dictionary, handle cases of the input string

In [51]:
def fun_string(stri):
    stri = stri.lower()
    count = 0
    dic ={'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5, 'f' : 6, 'g' : 7, 'h' : 8, 'i' : 9, 'j' : 10, 'k' : 11, 'l' : 12, 
       'm' : 13, 'n' : 14, 'o': 15, 'p':16, 'q':17, 'r':18, 's':19, 't':20, 'u':21, 'v':22,'w':23, 'x':24, 'y':25,'z':26}
    for character in stri:
        count = count + dic[character]
    print(count)

In [52]:
fun_string("Regards")

72

### 3. Read the ‘bank.csv’ file as DataFrame with Pandas and answer/solve the following questions.

#### a. Reading in the data, importing modules

In [53]:
import os
os.getcwd()

'D:\\INSOFE\\CUTe01'

In [215]:
import pandas as pd
bank_data = pd.read_csv('bank.csv', sep= ';') # importing a bank data set with ; a seperator

#### b. Structure, Summary, Head and Tail of the data

In [216]:
bank_data.describe() # summary of the data

,age,balance,day,duration,campaign,pdays,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,39.766645,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,100.121124,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [217]:
bank_data.info() # structure of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4521 non-null object
marital      4521 non-null object
education    4521 non-null object
default      4521 non-null object
balance      4521 non-null int64
housing      4521 non-null object
loan         4521 non-null object
contact      4521 non-null object
day          4521 non-null int64
month        4521 non-null object
duration     4521 non-null int64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4521 non-null object
dtypes: int64(7), object(10)
memory usage: 600.5+ KB

In [218]:
bank_data.head() # head of 5 rows

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [219]:
bank_data.tail() # tail of 5 rows

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

#### a. What is the most common occupation in the ‘job’ column?

In [220]:
bank_data['job'].value_counts() # management is the most common accoupation

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

#### b. What is the mean ‘balance’ for people with marital status as married and also education as tertiary?

In [221]:
bank_data[(bank_data.marital == "married") & (bank_data.education == "tertiary")].mean()

age           41.777166
balance     1860.719395
day           15.751032
duration     256.752407
campaign       2.916094
pdays         36.764787
previous       0.555708
dtype: float64

#### c. What is the mean ‘age’ for different ‘education’ categories?

In [222]:
bank_data.groupby('education')['age'].mean()

education
primary      46.833333
secondary    40.062446
tertiary     39.645926
unknown      45.299465
Name: age, dtype: float64

d. Drop the following columns from the dataframe: job, day, month, pdays, previous, poutcome.

In [223]:
bank_data = bank_data.drop(columns= ['job','day','month','pdays','previous','poutcome'], axis= 1)

In [224]:
bank_data_NumAtr = bank_data[['age', 'balance', 'duration', 'campaign']]
bank_data_CatAtr = bank_data.drop(['age', 'balance', 'duration', 'campaign'], 
                        axis=1, inplace=False)

In [225]:
bank_data_CatAtr = bank_data_CatAtr.apply(pd.Categorical, axis=0)
bank_data_CatAtr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 7 columns):
marital      4521 non-null category
education    4521 non-null category
default      4521 non-null category
housing      4521 non-null category
loan         4521 non-null category
contact      4521 non-null category
y            4521 non-null category
dtypes: category(7)
memory usage: 31.7 KB

#### e. Recode categorical variables with 2 levels as 0 & 1.

In [226]:
bank_data_CatAtr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 7 columns):
marital      4521 non-null category
education    4521 non-null category
default      4521 non-null category
housing      4521 non-null category
loan         4521 non-null category
contact      4521 non-null category
y            4521 non-null category
dtypes: category(7)
memory usage: 31.7 KB

In [227]:
print(pd.unique(bank_data_CatAtr.marital))
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.education)) # is having more than 2 levels
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.default))
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.housing))
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.loan))
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.contact)) # is having more than two levels
print("---------------------------------------")
print(pd.unique(bank_data_CatAtr.y))

[married, single, divorced]
Categories (3, object): [married, single, divorced]
---------------------------------------
[primary, secondary, tertiary, unknown]
Categories (4, object): [primary, secondary, tertiary, unknown]
---------------------------------------
[no, yes]
Categories (2, object): [no, yes]
---------------------------------------
[no, yes]
Categories (2, object): [no, yes]
---------------------------------------
[no, yes]
Categories (2, object): [no, yes]
---------------------------------------
[cellular, unknown, telephone]
Categories (3, object): [cellular, unknown, telephone]
---------------------------------------
[no, yes]
Categories (2, object): [no, yes]

In [228]:
import numpy
marital_new = np.zeros(bank_data_CatAtr.shape[0])
for i in range(bank_data_CatAtr.shape[0]):
    if bank_data_CatAtr.marital[i] == "married":
        marital_new[i] = 1
    else:
        marital_new[i] = 0

In [229]:
default_new = np.zeros(bank_data_CatAtr.shape[0])
for i in range(bank_data_CatAtr.shape[0]):
    if bank_data_CatAtr.default[i] == "yes":
        default_new[i] = 1
    else:
        default_new[i] = 0

In [230]:
housing_new = np.zeros(bank_data_CatAtr.shape[0])
for i in range(bank_data_CatAtr.shape[0]):
    if bank_data_CatAtr.housing[i] == "yes":
        housing_new[i] = 1
    else:
        housing_new[i] = 0

In [231]:
loan_new = np.zeros(bank_data_CatAtr.shape[0])
for i in range(bank_data_CatAtr.shape[0]):
    if bank_data_CatAtr.loan[i] == "yes":
        loan_new[i] = 1
    else:
        loan_new[i] = 0

In [232]:
y_new = np.zeros(bank_data_CatAtr.shape[0])
for i in range(bank_data_CatAtr.shape[0]):
    if bank_data_CatAtr.y[i] == "yes":
        y_new[i] = 1
    else:
        y_new[i] = 0

In [233]:
bank_data_CatAtr['marital'] = marital_new
bank_data_CatAtr['default'] = default_new
bank_data_CatAtr['housing'] = housing_new
bank_data_CatAtr['loan'] = loan_new
bank_data_CatAtr['y'] = y_new

In [234]:
bank_data_CatAtr.head() # checking if values are replaced BY 0 OR 1

   marital  education  default  housing  loan   contact    y
0      1.0    primary      0.0      0.0   0.0  cellular  0.0
1      1.0  secondary      0.0      1.0   1.0  cellular  0.0
2      0.0   tertiary      0.0      1.0   0.0  cellular  0.0
3      1.0   tertiary      0.0      1.0   1.0   unknown  0.0
4      1.0  secondary      0.0      1.0   0.0   unknown  0.0

#### f. Replace categorical variables with more than 2 levels with their respective dummy variables.

In [235]:
#print(pd.unique(bank_data_CatAtr.education))
print(bank_data_CatAtr.info())
#print(pd.unique(bank_data_CatAtr))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 7 columns):
marital      4521 non-null float64
education    4521 non-null category
default      4521 non-null float64
housing      4521 non-null float64
loan         4521 non-null float64
contact      4521 non-null category
y            4521 non-null float64
dtypes: category(2), float64(5)
memory usage: 185.8 KB
None

In [236]:
EduDummyVars = pd.get_dummies(bank_data_CatAtr.education) # creating dummies for education

ConDummyVars = pd.get_dummies(bank_data_CatAtr.contact) # creating dumies for contact

In [238]:
EduDummyVars.columns = ['Edu1', 'Edu2', 'Edu3', 'Edu4']# inputting the column names for dummies

ConDummyVars.columns = ['Contact1', 'Contact2', 'Contact3']

bank_data_CatAtr = bank_data_CatAtr.join(EduDummyVars)
bank_data_CatAtr = bank_data_CatAtr.join(ConDummyVars)

In [239]:
bank_data_CatAtr.head()

,marital,education,default,housing,loan,contact,y,Edu1,Edu2,Edu3,Edu4,Contact1,Contact2,Contact3
0,1.0,primary,0.0,0.0,0.0,cellular,0.0,1,0,0,0,1,0,0
1,1.0,secondary,0.0,1.0,1.0,cellular,0.0,0,1,0,0,1,0,0
2,0.0,tertiary,0.0,1.0,0.0,cellular,0.0,0,0,1,0,1,0,0
3,1.0,tertiary,0.0,1.0,1.0,unknown,0.0,0,0,1,0,0,0,1
4,1.0,secondary,0.0,1.0,0.0,unknown,0.0,0,1,0,0,0,0,1

In [240]:
bank_data_CatAtr = bank_data_CatAtr.drop(['education'], axis= 1)# dropping the educatioin attribute
bank_data_CatAtr = bank_data_CatAtr.drop(['contact'], axis= 1)
bank_data_CatAtr.head()

,marital,default,housing,loan,y,Edu1,Edu2,Edu3,Edu4,Contact1,Contact2,Contact3
0,1.0,0.0,0.0,0.0,0.0,1,0,0,0,1,0,0
1,1.0,0.0,1.0,1.0,0.0,0,1,0,0,1,0,0
2,0.0,0.0,1.0,0.0,0.0,0,0,1,0,1,0,0
3,1.0,0.0,1.0,1.0,0.0,0,0,1,0,0,0,1
4,1.0,0.0,1.0,0.0,0.0,0,1,0,0,0,0,1

#### g. Standardize the numeric columns

In [241]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler(with_mean=True, with_std=True)

In [242]:
bank_data_NumAtr1 = scaler.fit_transform(bank_data_NumAtr)

bank_data_NumAtr1 = pd.DataFrame(bank_data_NumAtr1, columns=bank_data_NumAtr.columns)
bank_data_NumAtr1.head()

        age   balance  duration  campaign
0 -1.056270  0.121072 -0.711861 -0.576829
1 -0.772583  1.118644 -0.169194 -0.576829
2 -0.583458 -0.024144 -0.303898 -0.576829
3 -1.056270  0.017726 -0.250017  0.387967
4  1.686036 -0.472753 -0.146102 -0.576829